; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v5 - type_1 ?v2 - type_2)
 	      (pred_2 ?v6 - object ?v2 - type_2)
	      (pred_1 ?v5 - type_1 ?v3 - type_3)
	      (pred_4 ?v5 - type_1 ?v6 - object ?v3 - type_3))

   (:action op_3
       :parameters  (?v5 - type_1 ?v4 ?v8 - type_2)
       :precondition (and  (pred_3 ?v5 ?v4))
       :effect (and  (pred_3 ?v5 ?v8)
		     (not (pred_3 ?v5 ?v4))))

   (:action op_2
       :parameters (?v5 - type_1 ?v1 - object ?v7 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v7) (pred_3 ?v5 ?v7) (pred_1 ?v5 ?v3))
       :effect (and (pred_4 ?v5 ?v1 ?v3)
		    (not (pred_2 ?v1 ?v7)) 
		    (not (pred_1 ?v5 ?v3))))

   (:action op_1
       :parameters (?v5 - type_1 ?v1 - object ?v7 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_4 ?v5 ?v1 ?v3) (pred_3 ?v5 ?v7))
       :effect (and (pred_2 ?v1 ?v7)
		    (pred_1 ?v5 ?v3)
		    (not (pred_4 ?v5 ?v1 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_11 obj_07 - type_1
obj_01 obj_05 obj_02 obj_08 - type_3
obj_06 obj_09 obj_04 obj_10 - type_2
obj_03 obj_13 obj_12 - object)
(:init
(pred_3 obj_11 obj_04)
(pred_1 obj_11 obj_01)
(pred_1 obj_11 obj_05)
(pred_3 obj_07 obj_06)
(pred_1 obj_07 obj_02)
(pred_1 obj_07 obj_08)
(pred_2 obj_03 obj_04)
(pred_2 obj_13 obj_06)
(pred_2 obj_12 obj_06)
)
(:goal
(and
(pred_2 obj_03 obj_10)
(pred_2 obj_13 obj_10)
(pred_2 obj_12 obj_09)
)
)

(:constraints
  (always (not (pred_3 obj_11 obj_10)))
)
)

; plan
1. (op_2 obj_11 obj_03 obj_04 obj_05)
   deleted: (pred_2 obj_03 obj_04) (pred_1 obj_11 obj_05)
   added: (pred_4 obj_11 obj_03 obj_05)
   goals met: 0 of 3
2. (op_2 obj_07 obj_12 obj_06 obj_08)
   deleted: (pred_2 obj_12 obj_06) (pred_1 obj_07 obj_08)
   added: (pred_4 obj_07 obj_12 obj_08)
   goals met: 0 of 3
3. (op_2 obj_07 obj_13 obj_06 obj_02)
   deleted: (pred_2 obj_13 obj_06) (pred_1 obj_07 obj_02)
   added: (pred_4 obj_07 obj_13 obj_02)
   goals met: 0 of 3
4. (op_3 obj_07 obj_06 obj_10)
   deleted: (pred_3 obj_07 obj_06)
   added: (pred_3 obj_07 obj_10)
   goals met: 0 of 3
5. (op_3 obj_11 obj_04 obj_09)
   deleted: (pred_3 obj_11 obj_04)
   added: (pred_3 obj_11 obj_09)
   goals met: 0 of 3
6. (op_1 obj_07 obj_13 obj_10 obj_02)
   deleted: (pred_4 obj_07 obj_13 obj_02)
   added: (pred_2 obj_13 obj_10) (pred_1 obj_07 obj_02)
   goals met: 1 of 3
7. (op_1 obj_11 obj_03 obj_09 obj_05)
   deleted: (pred_4 obj_11 obj_03 obj_05)
   added: (pred_2 obj_03 obj_09) (pred_1 obj_11 obj_05)
   goals met: 1 of 3
8. (op_3 obj_07 obj_10 obj_09)
   deleted: (pred_3 obj_07 obj_10)
   added: (pred_3 obj_07 obj_09)
   goals met: 1 of 3
9. (op_1 obj_07 obj_12 obj_09 obj_08)
   deleted: (pred_4 obj_07 obj_12 obj_08)
   added: (pred_2 obj_12 obj_09) (pred_1 obj_07 obj_08)
   goals met: 2 of 3
10. (op_2 obj_07 obj_03 obj_09 obj_08)
   deleted: (pred_2 obj_03 obj_09) (pred_1 obj_07 obj_08)
   added: (pred_4 obj_07 obj_03 obj_08)
   goals met: 2 of 3
11. (op_3 obj_07 obj_09 obj_10)
   deleted: (pred_3 obj_07 obj_09)
   added: (pred_3 obj_07 obj_10)
   goals met: 2 of 3
12. (op_1 obj_07 obj_03 obj_10 obj_08)
   deleted: (pred_4 obj_07 obj_03 obj_08)
   added: (pred_2 obj_03 obj_10) (pred_1 obj_07 obj_08)
   goals met: 3 of 3
